import React from 'react';

class UserProtocol extends React.Component {
  render () {
    return (
      <div className="m-body" style={{padding: '0.8125em 1em 0.8125em 1em'}}>
        <p className="txi">欢迎您访问一元购，申请使用武汉卓翰网络科技有限公司提供的一元购服务（以下简称“一元购“）。“一元购”指用户花费1元购买1个夺宝币，用户可使用夺宝币参与商品抽奖的服务。</p>
        <p className="txi">当使用一元购的各项具体服务时，您和一元购都将受到本服务协议所产生的制约，一元购会不断推出新的服务，因此所有服务都将受此服务条款的制约。请您在注册前务必认真阅读此服务协议的内容并确认，如有任何疑问，应向一元购咨询。
          一旦您确认本服务协议后，本服务协议即在用户和一元购产生法律效力。您在注册过程中勾选“我已阅读并同意”即表示您完全接受本协议中的全部条款。随后按照页面给予的提示完成全部的注册步骤。
          一元购将可能不定期的修改本服务协议的有关条款,并保留在必要时对此协议中的所有条款进行随时修改的权利。一旦协议内容有所修改，一元购将会在产品重要页面第一时间给予通知。如果您继续使用一元购的服务，则视为您受协议的改动内容。
          如果不同意本站对协议内容所做的修改，一元购及时取消您的服务使用权限。本站保留随时修改或中断服务而不需告知用户的权利。本站行使修改或中断服务的权利，不需对用户或第三方负责。</p>
        <p className="title red txi">一、用户注册</p>
        <p className="txi">1、用户注册是指用户登录一元购，按要求填写相关信息并确认同意本服务协议的过程。</p>
        <p className="txi">2、用户在使用一元购时须具备相应的权利能力和行为能力，能够独立承担法律责任，如果用户在18周岁以下，必须在父母或监护人的监护参与下才能使用本站。</p>
        <p className="title red txi">二、用户的账户，密码和安全性</p>
        <p className="txi">用户一旦注册成功，成为本站的合法用户。用户将对用户名和密码安全负全部责任。此外，每个用户都要对以其用户名进行的所有活动和事件负全责。用户若发现任何非法使用用户帐号或存在安全漏洞的情况，请立即通告本站。</p>
        <p className="title red txi">三、一元购原则</p>
        <p className="txi">1、释义</p>
        <p className="txi">（1）夺宝号码：指用户使用夺宝币参与一元购服务时所获取的随机分配号码。</p>
        <p className="txi">（2）幸运号码：指与某件商品的全部夺宝号码分配完毕后，一元购根据夺宝规则（详见一元购官方页面）计算出的一个号码。持有该幸运号码的用户可直接获得该商品。</p>
        <p className="txi">（3）夺宝币：指用户为获得商品所支付并由武汉卓翰网络科技有限公司预收货款后获得的使用一元购的凭据。</p>
        <p className="txi">a) 用户兑换夺宝币的同时将获得网盘，夺宝币的有效期自兑换之日起算360天。前述有效期不可中断或延期，有效期届满后，用户帐户中有效期届满的夺宝币将被清空，且不可恢复。</p>
        <p className="txi">b) 夺宝币必须通过武汉卓翰网络科技有限公司提供或认可的平台获得，从非武汉卓翰网络科技有限公司提供或认可的平台所获得的夺宝币将被认定为来源不符合本服务协议，武汉卓翰网络科技有限公司有权拒绝从非武汉卓翰网络科技有限公司提供或认可的平台所获得的夺宝币在一元购中使用。</p>
        <p className="txi">c) 夺宝币不可退还，不能用于购买或兑换其它武汉卓翰网络科技有限公司收费服务或者转移给其他用户。</p>
        <p className="txi">2、一元购网站承诺以下的原则运营网站，确保所有用户在一元购网中享受同等的权利和义务。</p>
        <p className="txi">平等原则：用户和一元购在交易过程中具有同等的法律地位。</p>
        <p className="txi">自由原则：用户享有自愿向一元购参与购买商品的权利，任何人不得非法干预。</p>
        <p className="txi">公平原则：用户和一元购行使权利、履行义务应当遵循公平原则。</p>
        <p className="txi">诚实信用原则：用户和一元购行使权利、履行义务应当遵循诚实信用原则。</p>
        <p className="txi">履行义务原则：用户向一元购参与商品分享购买时，用户和一元购皆有有义务根据本服务协议的约定完成该等交易（法律或本协议禁止的交易除外）</p>
        <p className="txi">3、用户知悉，除本协议另有约定外，无论是否获得商品，用户用于参与一元购的夺宝币不能退回；其完全了解参与一元购活动的存在的风险，武汉卓翰网络科技有限公司不保证用户参与一元购一定会获得商品，但参与者均可获得相应的网盘空间。</p>
        <p className="txi">4、用户通过参与一元购获得的商品，享受该商品生产厂家提供的三包服务，具体三包规定以该商品生产厂家公布的为准。</p>
        <p className="txi">5、如果下列情形发生，武汉卓翰网络科技有限公司有权取消用户夺宝订单：</p>
        <p className="txi">（1）因不可抗力、一元购系统发生故障或遭受第三方攻击，或发生其他武汉卓翰网络科技有限公司无法控制的情形；</p>
        <p className="txi">（2）根据武汉卓翰网络科技有限公司已经发布的或将来可能发布或更新的各类规则、公告的规定，武汉卓翰网络科技有限公司有权取消用户订单的情形。</p>
        <p className="txi">武汉卓翰网络科技有限公司有权取消用户订单后，用户可申请退还夺宝币，所退夺宝币将在3个工作日内退还至用户帐户中。</p>
        <p className="txi">6、若某件商品的夺宝号码从开始分配之日起90天未分配完毕，则武汉卓翰网络科技有限公司有权取消该件商品的夺宝活动，并向用户退还夺宝币，所退还夺宝币将在3个工作日内退还至用户帐户中。</p>
        <p className="title red txi">四、用户的权利和义务</p>
        <p className="txi">1、用户有权拥有其在一元购的用户名及密码，并用该用户名和密码登录一元购参与商品购买。用户不得以任何形式转让或授权他人使用自己的一元购用户名。</p>
        <p className="txi">2、用户有权根据本协议的规定以及一元购上发布的相关规则在参加一元购的有关活动，以及享受一元购提供的其它信息服务</p>
        <p className="txi">3、用户有义务在注册时提供自己的真实资料，并保证诸如联系电话、联系地址等内容的有效性及真实性，保证一元购可以通过上述联系方式与用户本人进行联系。同时，用户也有义务在相关资料发生变更时及时更新有关注册资料。用户保证不以他人资料在一元购进行注册和参与商品分享购买。</p>
        <p className="txi">4、用户应当保证在一元购参与商品分享购买时遵守诚实信用原则，不扰乱网上交易的正常秩序。</p>
        <p className="title red txi">五、一元购的权利和义务</p>
        <p className="txi">1、一元购有义务在现有技术上维护整个网上交易平台的正常运行，并努力提升和改进技术，使用户网上交易活动得以顺利进行；</p>
        <p className="txi">2、对用户在注册和使用一元购网上交易平台中所遇到的与交易或注册有关的问题及反映的情况，一元购应及时作出回复；</p>
        <p className="txi">3、对于用户在一元购网站上作出下列行为的，一元购有权作出删除相关信息、终止提供服务等处理，而无须征得用户的同意：</p>
        <p className="txi">1) 一元购有权对用户的注册信息及购买行为进行查阅，发现注册信息或购买行为中存在任何问题的，有权向用户发出询问及要求改正的通知或者作出删除等处理；</p>
        <p className="txi">2) 用户违反本协议规定或有违反法律法规和地方规章的行为的，一元购有权停止传输并删除其信息，禁止用户发言，注销用户账户并按照相关法律规定向相关主管部门进行披露。</p>
        <p className="txi">3) 对于用户在一元购进行的下列行为，一元购有权对用户采取删除其信息、注销用户账户等限制性措施：包括发布或以电子邮件或以其他方式传送存在恶意、虚假和侵犯他人人身财产权利内容的信息.</p>
        <p className="txi">4、用户在此免费授予一元购永久性的独家使用权(并有权对该权利进行再授权)，使一元购有权在全球范围内(全部或部分地)使用、复制、修订、改写、发布、翻译和展示用户公示于一元购网站的各类信息，或制作其派生作品，和或以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其它作品内。</p>
        <p className="txi">5、对于一元购网络平台已上架商品，一元购有权根据市场变动修改商品价格，而无需提前通知客户。</p>
        <p className="txi">6、一元购分享购物模式，秉着双方自愿原则，分享购物存在风险，一元购不对抽取的“幸运编号”结果承担责任，望所有用户谨慎参与。</p>
        <p className="txi">7、90天未达到“总需参与人次”的商品，退款项将在3个工作日内，退还至夺宝账户中。</p>
        <p className="title red txi">六、配送及费用</p>
        <p className="txi">商品只支持中国地区的配送，一元购将会把产品送到您所指定的送货地址。</p>
        <p className="txi">请清楚准确地填写您的真实姓名、送货地址及联系方式。因如下情况造成配送延迟或无法配送等，本站将不承担责任：</p>
        <p className="txi">1、客户提供错误信息和不详细的地址。</p>
        <p className="txi">2、货物送达无人签收，由此造成的重复配送所产生的费用及相关的后果。</p>
        <p className="txi">3、不可抗力，例如：自然灾害、交通戒严、突发战争等。</p>
        <p className="title red txi">七、商品缺货规则</p>
        <p className="txi">用户通过参与一元购所获得的商品如果发生缺货，用户和一元购皆有权取消该交易，所花费的款一元购将全部返还到用户的夺宝账户。或一元购对缺货商品进行预售登记，一元购会尽最大努力在最快时间内满足用户的购买需求，当缺货商品到货，一元购将第一时间通知用户，方便用户进行购买。</p>
        <p className="title red txi">八、责任限制</p>
        <p className="txi">在法律法规所允许的限度内，因使用一元购服务而引起的任何损害或经济损失，一元购承担的全部责任均不超过用户所购买的与该索赔有关的商品价格。这些责任限制条款将在法律所允许的最大限度内适用，并在用户资格被撤销或终止后仍继续有效。</p>
        <p className="title red txi">九、应用服务内容的所有权</p>
        <p className="txi">本站定义的服务内容包括：文字、软件、声音、图片、图表；电子邮件的全部内容；本站为用户提供的其他信息。所有这些内容受版权、商标、标签和其它财产所有权法律的保护。所以，用户只能在本站和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。本站所有的文章版权归原文作者和本站共同所有，任何人需要转载本站的文章，必须征得原文作者或本站授权。</p>
        <p className="title red txi">十、用户隐私制度</p>
        <p className="txi">我们不会向任何第三方提供，出售，出租，分享和交易用户的个人信息。当在以下情况下，用户的个人信息将部分或全部被善意披露：</p>
        <p className="txi">1、经用户同意，向第三方披露；</p>
        <p className="txi">2、如用户是合资格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；</p>
        <p className="txi">3、根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；</p>
        <p className="txi">4、如果用户出现违反中国有关法律或者网站政策的情况，需要向第三方披露；</p>
        <p className="txi">5、为提供你所要求的产品和服务，而必须和第三方分享用户的个人信息；</p>
        <p className="txi">6、其它本站根据法律或者网站政策认为合适的披露。</p>
        <p className="title red txi">十一、法律管辖和适用</p>
        <p className="txi">1、本协议的订立、执行和解释及争议的解决均应适用中国法律。</p>
        <p className="txi">2、如发生本站服务条款与中国法律相抵触时，则这些条款将完全按法律规定重新解释，而其它合法条款则依旧保持对用户产生法律效力和影响。</p>
        <p className="txi">3、本协议的规定是可分割的，如本协议任何规定被裁定为无效或不可执行，该规定可被删除而其余条款应予以执行。</p>
        <p className="txi">4、如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向本站所在地的人民法院提起诉讼。</p>
      </div>
    );
  }
}

export default UserProtocol;
